openFoamV8/heatedDuct_c_v2/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    fluidInlet
    {
        type            patch;
        nFaces          1038;
        startFace       962812;
    }
    fluidOutlet
    {
        type            patch;
        nFaces          1038;
        startFace       963850;
    }
    fluid_to_metal
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          140800;
        startFace       964888;
        sampleMode      nearestPatchFace;
        sampleRegion    metal;
        samplePatch     metal_to_fluid;
    }
)

// ************************************************************************* //
