openFoamV8/heatedDuct_c_v2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    metalInlet
    {
        type            wall;
        nFaces          1620;
        startFace       2207194;
    }
    fluidInlet
    {
        type            patch;
        nFaces          1038;
        startFace       2208814;
    }
    metalOutlet
    {
        type            wall;
        nFaces          1620;
        startFace       2209852;
    }
    fluidOutlet
    {
        type            patch;
        nFaces          1038;
        startFace       2211472;
    }
    metalExternal
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5500;
        startFace       2212510;
    }
)

// ************************************************************************* //
